In [26]:
import pandas as pd
import numpy as np

In [27]:
data = pd.read_csv("internetkullanimveri-temizlenmemis.csv")

In [28]:
data.info

<bound method DataFrame.info of     _id   tarih  android  apple  windows  linux  unknown  toplam  unnamed:_7  \
0     1  Oca.21     1528    320      108      2        0    1958         NaN
1     2  Žub.21     1861    360       88      2        0    2311         NaN
2     3  Mar.21     2196    463      171      6        1    2837         NaN
3     4  Nis.21     1882    385      126      2        0    2395         NaN
4     5  May.21     1813    358       87      4        0    2262         NaN
5     6  Haz.21     2692    565      176      1        1    3435         NaN
6     7  Tem.21     3204    744      141      2        0    4091         NaN
7     8  Ašu.21     2469    685      122      0        1    3277         NaN
8     9  Eyl.21     3160    600      112      2        0    3874         NaN
9    10  Eki.21     4149    805      689      1        0    5644         NaN
10   11  Kas.21     4087    738      854      0        1    5680         NaN
11   12  Ara.21     3871    691      668      2        0    5232         NaN
12   13  Oca.22     3568    637      573      1        0    4779         NaN
13   14  Žub.22     3331    526      805      2        0    4664         NaN

    unnamed:_8
0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8          NaN
9          NaN
10         NaN
11         NaN
12         NaN
13         NaN  >

In [29]:
data.head()

,_id,tarih,android,apple,windows,linux,unknown,toplam,unnamed:_7,unnamed:_8
0,1,Oca.21,1528,320,108,2,0,1958,NaN,NaN
1,2,Žub.21,1861,360,88,2,0,2311,NaN,NaN
2,3,Mar.21,2196,463,171,6,1,2837,NaN,NaN
3,4,Nis.21,1882,385,126,2,0,2395,NaN,NaN
4,5,May.21,1813,358,87,4,0,2262,NaN,NaN

In [30]:
data= data.drop(columns="_id", axis=0)

In [31]:
data= data.drop(columns="unnamed:_7", axis=0)

In [32]:
data= data.drop(columns="unnamed:_8", axis=0)

In [33]:
data[['ay', 'yil']] = data["tarih"].astype('str').str.split(".", expand=True)

In [34]:
data= data.drop(columns="tarih", axis=0)

In [35]:
data["ay"] = data["ay"].replace({
    'Oca' : 'ocak',
    'Žub' : 'subat',
    'Mar' : 'mart',
    'Nis' : 'nisan',
    'May' : 'mayis',
    'Haz' : 'haziran',
    'Tem' : 'temmuz',
    'Ašu' : 'agustos',
    'Eyl' : 'eylul',
    'Eki' : 'ekim',
    'Kas' : 'kasim',
    'Ara' : 'aralik'
})

In [36]:
data["yil"] = data["yil"].replace({
    '21' : '2021',
    '22' : '2022'
})

In [37]:
data.head()

   android  apple  windows  linux  unknown  toplam     ay   yil
0     1528    320      108      2        0    1958   ocak  2021
1     1861    360       88      2        0    2311  subat  2021
2     2196    463      171      6        1    2837   mart  2021
3     1882    385      126      2        0    2395  nisan  2021
4     1813    358       87      4        0    2262  mayis  2021

In [38]:
data.rename(columns={"apple" : "ios"}, inplace=True)

In [39]:
data["ay"] = data["ay"].astype(str)

In [40]:
data["yil"] = data["yil"].astype(int)

In [41]:
data.head()

   android  ios  windows  linux  unknown  toplam     ay   yil
0     1528  320      108      2        0    1958   ocak  2021
1     1861  360       88      2        0    2311  subat  2021
2     2196  463      171      6        1    2837   mart  2021
3     1882  385      126      2        0    2395  nisan  2021
4     1813  358       87      4        0    2262  mayis  2021

In [42]:
for index, row in data.iterrows():
    toplam_kontrol = row['android'] + row['ios'] + row['windows'] + row['linux'] + row['unknown']
    if toplam_kontrol != row['toplam']:
        print(f'toplam {index}. index için yanlış.')
    else:
        print(f'toplam {index}. index için doğru.')

toplam 0. index için doğru.
toplam 1. index için doğru.
toplam 2. index için doğru.
toplam 3. index için doğru.
toplam 4. index için doğru.
toplam 5. index için doğru.
toplam 6. index için doğru.
toplam 7. index için doğru.
toplam 8. index için doğru.
toplam 9. index için doğru.
toplam 10. index için doğru.
toplam 11. index için doğru.
toplam 12. index için doğru.
toplam 13. index için doğru.

In [43]:
yeni_sutunlar = ["yil", "ay", "android", "ios", "windows", "linux", "unknown", "toplam"]

In [44]:
data = data[yeni_sutunlar]

In [45]:
data.drop(columns="yil", inplace=True)

In [47]:
data

         ay  android  ios  windows  linux  unknown  toplam
0      ocak     1528  320      108      2        0    1958
1     subat     1861  360       88      2        0    2311
2      mart     2196  463      171      6        1    2837
3     nisan     1882  385      126      2        0    2395
4     mayis     1813  358       87      4        0    2262
5   haziran     2692  565      176      1        1    3435
6    temmuz     3204  744      141      2        0    4091
7   agustos     2469  685      122      0        1    3277
8     eylul     3160  600      112      2        0    3874
9      ekim     4149  805      689      1        0    5644
10    kasim     4087  738      854      0        1    5680
11   aralik     3871  691      668      2        0    5232
12     ocak     3568  637      573      1        0    4779
13    subat     3331  526      805      2        0    4664

In [46]:
data.to_csv("/Users/o/Desktop/acik-veri-calismalari/ucretsiz-wifi-kullanim-sayilari/ucretsiz-wifi-kullanim-sayilari.csv", index=False, header=True)
data.to_excel("/Users/o/Desktop/acik-veri-calismalari/ucretsiz-wifi-kullanim-sayilari/ucretsiz-wifi-kullanim-sayilari.xlsx", index=False, header=True)